<template>
  <div class="textCenterizer">
    <h1>Grammar Page</h1>
    <p>ここには文法についてまとめます。</p>
  </div>
  <div>
    <div class="text-box">
      <h2>基本的な文</h2>
      <br>
      <h3>○平叙文</h3>
      <p>Э&#769;то па&#769;рк.</p>
      <p>これは公園です</p>
      <br>
      <p>э&#769;тоは「これ」、па&#769;ркは「公園」という意味
        <br>parkがпа&#769;ркなのは分かりやすくていいですね</p>
      <p>また文頭を大文字にするのは英語と同じです</p>
      <br>
      <p>ロシア語の特徴として、英語やドイツ語、フランス語のような冠詞(a,the等)がありません</p>
      <p>英作文をしている時のように悩むことはないのが素晴らしい！！</p>
      <br>
      <p>そして現在時制のSVC型の文の場合、英語のbe動詞に当たる語(бы&#769;ть)は普通使わずに省略します</p>
      <br>
      <h3>○疑問文</h3>
      <p>Э&#769;то па&#769;рк?</p>
      <p>これは公園ですか？</p>
      <br>
      <p>英語のように語順を入れ替える必要はなく、語末の.を?に変えるだけで疑問文になります</p>
      <br>
      <p>○断定と疑問のイントネーション</p>
      <p>断定と疑問では文の形が変わらないので発音する際にはイントネーションで区別します</p>
      <br>
      <p>断定 : 文の最後の単語のアクセントがある音節（母音）で下降する</p>
      <p>疑問 : 疑問の中心になる単語のアクセントのある音節（母音）で上昇する</p>
      <br>
      <p>断定は英語と一緒ですね</p>
      <p>Э&#769;то па&#769;рк.</p>
      <p>-- ↘_</p>
      <br>
      <p>疑問については、例えば「これは『公園』ですか？」と「公園」を強調して聞きたいときには</p>
      <p>Э&#769;то па&#769;рк?</p>
      <p>-- ↗￣</p>
      <br>
      <p>「『これ』は公園ですか？」と「これ」を強調して聞きたいときには</p>
      <p>э&#769;то па&#769;рк?</p>
      <p>↗￣- -</p>
      <p>となります</p>
      <p>必要なところだけアクセントを上げ、それ以降は普通のままで、上げません</p>
      <br>
      <h3>○否定文</h3>
      <p>Э&#769;то не па&#769;рк.</p>
      <p>これは公園ではありません</p>
      <br>
      <p>否定文では否定したい単語の前にне(〜ではない)をつけます</p>
      <p>否定の助詞неには普通アクセントをつけず、次の単語と繋げて発音します</p>
      <p>непа&#769;ркのように一単語として発音するイメージです</p>
      <br>
      <h3>○疑問文の答え方</h3>
      <p>Э&#769;то па&#769;рк?</p>
      <br>
      <p>Да, Э&#769;то па&#769;рк.</p>
      <p>はい、これは公園です</p>
      <p>Нет, Э&#769;то не па&#769;рк.</p>
      <p>いいえ、これは公園ではありません</p>
      <br>
      <p>疑問文にはДа(yes)とНет(no)を使って返答しましょう</p>
      <p>返答の仕方は英語と同じです</p>
      <br>
      <h3>○疑問詞を使った疑問文</h3>
        <p>Ктo э&#769;то? — Э&#769;то Иван.</p>
        <p>これはだれですか？ — これはイワンです</p>
        <br>
        <p>Что э&#769;то? — Э&#769;то кни́га.</p>
        <p>これは何ですか？ — これは本です</p>
        <br>
        <p><b>Где Анна?</b> — Она до&#769;ма.</p>
        <p>彼はどこですか？ — 彼は家にいます</p>
        <br>
        <p>чтоはものについて尋ねるとき、ктoは人や動物について尋ねるときに使います</p>
        <p>гдеは人や物が存在する（いる/ある）場所を尋ねるときに使います</p>
        <br>
        <p>疑問詞のある疑問文では疑問詞でイントネーションを上げ、それ以降はそのままです</p>
        <p>「『これ』は公園ですか？」の文のように発音します</p>
        <br>
        <p>онаは「彼女」を意味する代名詞で、英語で言えばsheです</p>
        <p>彼の場合はонになります</p>
        <p>до&#769;маは「家で、家に」という意味の副詞です</p>
        <p>гдеの文で使える副詞としては他に、там(あそこに、あそこで)、здесь(ここで、ここに)などがあります</p>
        <br>
        <p>他の疑問詞としては、Куда&#769;(どこへ),Когда&#769;(いつ),Почему&#769;(なぜ),Как(どのように/どうやって)などがありますが、ここではその紹介だけに留めます
          <br>なぜならこれらを使う文を考えるときには動詞を使いたくなり、動詞を使った文を扱うためにはその前に性と数、格変化について扱わなければならないからです</p>
    </div>
    <div class="text-box">
      <h2>名詞の性と数</h2>
    </div>
    <div class="text-box">
      <h2>ざっくりと格変化</h2>
    </div>
    <div class="text-box">
      <h2>現在形</h2>
    </div>
    <div class="text-box">
      <h2>過去形</h2>
    </div>
    <div class="text-box">
      <h2>未来形</h2>
    </div>
    <div class="text-box">
      <h2>格変化</h2>
    </div>
  </div>
</template>

<style scoped>

</style>