<template>
  <div class="textCenterizer">
    <h1>Урок по Грамматике</h1>
    <p>ここには文法についてまとめます</p>
  </div>
  <div>
    <div class="text-box">
      <h2>基本的な文</h2>
      <br>
      <h3>○平叙文</h3>
      <p>Э&#769;то па&#769;рк.</p>
      <p>これは公園です</p>
      <br>
      <p>э&#769;тоは「これ」、па&#769;ркは「公園」という意味
        <br>parkがпа&#769;ркなのは分かりやすくていいですね</p>
      <p>また文頭を大文字にするのは英語と同じです</p>
      <br>
      <p>ロシア語の特徴として、英語やドイツ語、フランス語のような冠詞(a,the等)がありません</p>
      <p>英作文をしている時のように悩むことはないのが素晴らしい！！</p>
      <br>
      <p>そして現在時制のSVC型の文の場合、英語のbe動詞に当たる語(бы&#769;ть)は普通使わずに省略します</p>
      <br>
      <h3>○疑問文</h3>
      <p>Э&#769;то па&#769;рк?</p>
      <p>これは公園ですか？</p>
      <br>
      <p>英語のように語順を入れ替える必要はなく、語末の.を?に変えるだけで疑問文になります</p>
      <br>
      <p>○断定と疑問のイントネーション</p>
      <p>断定と疑問では文の形が変わらないので発音する際にはイントネーションで区別します</p>
      <br>
      <p>断定 : 文の最後の単語のアクセントがある音節（母音）で下降する</p>
      <p>疑問 : 疑問の中心になる単語のアクセントのある音節（母音）で上昇する</p>
      <br>
      <p>断定は英語と一緒ですね</p>
      <p>Э&#769;то па&#769;рк.</p>
      <p>-- ↘_</p>
      <br>
      <p>疑問については、例えば「これは『公園』ですか？」と「公園」を強調して聞きたいときには</p>
      <p>Э&#769;то па&#769;рк?</p>
      <p>-- ↗￣</p>
      <br>
      <p>「『これ』は公園ですか？」と「これ」を強調して聞きたいときには</p>
      <p>э&#769;то па&#769;рк?</p>
      <p>↗￣- -</p>
      <p>となります</p>
      <p>必要なところだけアクセントを上げ、それ以降は普通のままで、上げません</p>
      <br>
      <h3>○否定文</h3>
      <p>Э&#769;то не па&#769;рк.</p>
      <p>これは公園ではありません</p>
      <br>
      <p>否定文では否定したい単語の前にне(〜ではない)をつけます</p>
      <p>否定の助詞неには普通アクセントをつけず、次の単語と繋げて発音します</p>
      <p>непа&#769;ркのように一単語として発音するイメージです</p>
      <br>
      <h3>○疑問文の答え方</h3>
      <p>Э&#769;то па&#769;рк?</p>
      <br>
      <p>Да, Э&#769;то па&#769;рк.</p>
      <p>はい、これは公園です</p>
      <p>Нет, Э&#769;то не па&#769;рк.</p>
      <p>いいえ、これは公園ではありません</p>
      <br>
      <p>疑問文にはДа(yes)とНет(no)を使って返答しましょう</p>
      <p>返答の仕方は英語と同じです</p>
      <br>
      <h3>○疑問詞を使った疑問文</h3>
      <p>Ктo э&#769;то? — Э&#769;то Иван.</p>
      <p>これはだれですか？ — これはイワンです</p>
      <br>
      <p>Что э&#769;то? — Э&#769;то кни́га.</p>
      <p>これは何ですか？ — これは本です</p>
      <p>※чтоは例外で[што]と発音する</p>
      <br>
      <p><b>Где Анна?</b> — Она до&#769;ма.</p>
      <p>彼はどこですか？ — 彼は家にいます</p>
      <br>
      <p>чтоはものについて尋ねるとき、ктoは人や動物について尋ねるときに使います</p>
      <p>гдеは人や物が存在する（いる/ある）場所を尋ねるときに使います</p>
      <br>
      <p>疑問詞のある疑問文では疑問詞でイントネーションを上げ、それ以降はそのままです</p>
      <p>「『これ』は公園ですか？」の文のように発音します</p>
      <br>
      <p>онаは「彼女」を意味する代名詞で、英語で言えばsheです</p>
      <p>彼の場合はонになります</p>
      <p>
        詳しくは
        <a href="#p_pronoun" @click.prevent="scrollToId('p_pronoun')">人称代名詞</a>
        を参照
      </p>        
      <br>
      <p>до&#769;маは「家で、家に」という意味の副詞です</p>
      <p>гдеの文で使える副詞としては他に、там(あそこに、あそこで)、здесь(ここで、ここに)などがあります</p>
      <br>
      <p>他の疑問詞としては、Куда&#769;(どこへ),Когда&#769;(いつ),Почему&#769;(なぜ),Как(どのように/どうやって)などがありますが、ここではその紹介だけに留めます
        <br>なぜならこれらを使う文を考えるときには動詞を使いたくなり、動詞を使った文を扱うためにはその前に性と数、格変化について扱わなければならないからです</p>
    </div>
    <div class="text-box">
      <h2>名詞の性と数</h2>
      <br>
      <p>ロシア語の名詞には文法上の性(男性・女性・中性)があります</p>
      <p>それぞれの単語の性は、（多少の例外はあるにしろ）概ね末尾の文字によって決まります</p>
      <br>
      <p>いやぁ、末尾の文字で性が分かるなんて簡単なシステムでよかった、フランス語やドイツ語では各単語ごとに不規則に決まっていて全部暗記しないといけないですから</p>
      <br>
      <table class="center-table">
        <tr>
          <th></th>
          <th colspan="3">末尾の文字</th>
        </tr>
        <tr>
          <td>男性名詞</td>
          <td>(й以外の子音文字)<br>журна&#769;л 雑誌</td>
          <td>й<br>музе&#769;й 博物館</td>
          <td>ь<br>слова&#769;рь 辞書</td>
        </tr>
        <tr>
          <td>女性名詞</td>
          <td>а<br>по&#769;чта 郵便局</td>
          <td>я<br>ле&#769;кция 講義</td>
          <td>ь<br>тетра&#769;дь ノート</td>
        </tr>
        <tr>
          <td>中性名詞</td>
          <td>о<br>письмо&#769; 手紙</td>
          <td>е<br>мо&#769;ре 海</td>
          <td>мя<br>вре&#769;мя 時間</td>
        </tr>
      </table>
      <br>
      <p>それでもьで終わる単語は男性名詞にも女性名詞にもあるので、ьで終わる単語に関しては暗記が必要ですが......これでもだいぶ楽な方だと思って割り切りましょう！</p>
      <br>
      <p>また、例外として、аやяで終わっていたとしても男性を表す単語なら男性名詞となります</p>
      <br>
      <p>例 : па&#769;па(父親), дя&#769;дя(叔父), ми&#769;ша(михаилの愛称)</p>
      <br>
      <p>ми&#769;шаっていうと日本人の感覚としては響きが女性っぽいですが、男性の名前なんですよね......ロシア語の愛称は不可思議</p>
      <br>
      <p>名詞を複数形にするときには、英語のように単純にsをつけるのではなく、名刺の性や末尾の文字によって末尾の形を変化させます</p>
      <br>
      <table class="center-table">
        <tr>
          <th></th>
        <th colspan="3">末尾の文字（単数形）</th>
        </tr>
        <tr>
          <td>男性名詞</td>
          <td>(й以外の子音文字)<br>журна́л → журна́лы</td>
          <td>й<br>музе́й → музе́и</td>
          <td>ь<br>слова́рь → слова́ри</td>
        </tr>
        <tr>
          <td>女性名詞</td>
          <td>а<br>по́чта → по́чты</td>
          <td>я<br>ле́кция → ле́кции</td>
          <td>ь<br>тетра́дь → тетра́ди</td>
        </tr>
        <tr>
          <td>中性名詞</td>
          <td>о<br>пи́сьмо → пи́сьма</td>
          <td>е<br>мо́ре → мо́ря</td>
          <td>мя<br>вре́мя → вре́мена</td>
        </tr>
      </table>
      <br>
      <p>мя → менаだけ特殊ですが、他はй以外の子音の時を除いて、文字1つの文字が1つの文字に変わっているだけなので、頑張って覚えましょう！</p>
    </div>
    <div class="text-box">
      <h2>所有代名詞</h2>
      <br>
      <p>所有代名詞は名詞の性と数に合わせて変化します</p>
      <br>
      <table class="center-table">
        <tr>
          <th></th>
          <th>男性形</th>
          <th>女性形</th>
          <th>中性形</th>
          <th>複数形</th>
        </tr>
        <tr>
          <td>私の</td>
          <td>мой</td>
          <td>моя&#769;</td>
          <td>моё</td>
          <td>мои&#769;</td>
        </tr>
        <tr>
          <td>君の</td>
          <td>твой</td>
          <td>твоя&#769;</td>
          <td>твоё</td>
          <td>твои&#769;</td>
        </tr>
        <tr>
          <td>あなたの</td>
          <td>ваш</td>
          <td>ва&#769;ша</td>
          <td>ва&#769;ше</td>
          <td>ва&#769;ши</td>
        </tr>
      </table>
      <br>
      <p>「君の」と「あなたの」で意味が被ってると思うかもしれませんが、тыに対応するのがтвой、выに対応するのがвашです</p>
      <p>тыとвыの使い分けについては次項で</p>
      <p>твойはмойと同じ変化をするので覚えやすいですね</p>
      <br>
      <p>例</p>
      <p>мой па&#769;па 私の父</p>
      <p>твоя&#769; ма&#769;ма 君の母</p>
      <p>ва&#769;ше письмо&#769; あなたの手紙</p>
      <p>ва&#769;ши кни&#769;ги あなたの本(кни&#769;гиはкни&#769;гаの複数形)</p>
    </div>
    <div class="text-box" id="p_pronoun">
      <h2>人称代名詞</h2>
      <br>
      <p>人称代名詞の主格です(格については<a href="declension" @click.prevent="scrollToId('declension')">後述</a> )</p>
      <br>      
      <table class="center-table">
        <thead>
          <tr>
            <th></th>
            <th colspan="2">単数</th>
            <th colspan="2">複数</th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td>1人称</td>
            <td>私</td>
            <td>я</td>
            <td>私たち</td>
            <td>мы</td>
          </tr>
          <tr>
            <td rowspan="2">2人称</td>
            <td>君</td>
            <td>ты</td>
            <td rowspan="2">君たち、あなたたち</td>
            <td rowspan="2">вы</td>
          </tr>
          <tr>
            <td>あなた</td>
            <td>вы</td>
          </tr>
          <tr>
            <td rowspan="3">3人称</td>
            <td>彼</td>
            <td>он</td>
            <td rowspan="3">彼ら、彼女ら、それら</td>
            <td rowspan="3">они&#769;</td>
          </tr>
          <tr>
            <td>彼女</td>
            <td>она&#769;</td>
          </tr>
          <tr>
            <td>それ</td>
            <td>оно&#769;</td>
          </tr>
        </tbody>
      </table>
      <br>
      <p>注意点として、2人称単数を表す場合にも、遠慮がいる相手にはтыではなくвыを使います</p>
      <p>日本語で言えば、「君、お前」くらいのニュアンスの言葉がты、「あなた」がвыです</p>
      <br>
      <p>тыを使う相手は、家族、友人などの親しい相手、子供などに限られます</p>
      <p>丁寧に話すときや目上の人に話すときにはвыを使います</p>
      <br>
      <p>тыの複数形はвыですが、выは単数も複数もвыです</p>
      <br>
      <div style="white-space: pre-line;">
        {{ isExpanded ? fullText : shortText }}
        <span class="read-more" @click="toggleText">
          {{ isExpanded ? '< 折りたたむ' : '>続きを読む' }}
        </span>
      </div>
      <br>
      <p>例</p>
      <p>Кто вы?</p>
      <p>Я студент</p>
      <p>あなたは誰ですか？</p>
      <p>私は学生です</p>
      <br>
      <p>Кто вы?</p>
      <p>мы студенты(студентыはстудентの複数形)</p>
      <p>あなたたちは誰ですか？</p>
      <p>私たちは学生です</p>
      <br> 
    </div>
    <div class="text-box">
      <h2>動詞の変化</h2>
      <br>
      <h3>○現在形・第1変化</h3>
      <p>動詞の現在形は主語の人称と数によって語尾が変化します。
        <br>変化する前の形のことを<span style="color: red;">不定形</span>と呼び、多くの動詞は不定形がтьで終わります
      </p>
      <br>
      <p>動詞の変化には主に第1変化と第2変化があり、どちらの変化をするかは単語ごとに異なります</p>
      <p>しかし語尾を見ればある程度どちらか分かります</p>
      <p>ちなみに英語のような現在形と現在進行形の区別はありません</p>
      <br>
      <table class="center-table">
        <thead>
          <tr>
            <th>不定形</th>
            <th>знать</th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td>1人称単数 (я)</td>
            <td>я зна&#769;ю</td>
          </tr>
          <tr>
            <td>2人称単数( ты)</td>
            <td>ты зна&#769;ешь</td>
          </tr>
          <tr>
            <td>3人称単数 (он/она/оно)</td>
            <td>он/она/оно зна&#769;ет</td>
          </tr>
          <tr>
            <td>1人称複数 (мы)</td>
            <td>мы зна&#769;ем</td>
          </tr>
          <tr>
            <td>2人称複数 (вы)</td>
            <td>вы зна&#769;ете</td>
          </tr>
          <tr>
            <td>3人称複数 (они)</td>
            <td>они зна&#769;ют</td>
          </tr>
        </tbody>
      </table>
      <br>
      <p>はい、このあたりから暗記が辛くなってきますね</p>
      <p>ロシア語学習で一番辛いのがこのような多彩な格変化です</p>
      <p>逆に言えば格変化をマスターすれば後はどうにでもなります</p>
      <p>.....なーんて綺麗事言っても辛いものは辛いので、ただ頑張るしかないですね</p>
      <br>
      <p>例</p>
      <p>Что вы де&#769;лаете?</p>
      <p>Я чита&#769;ю</p>
      <p>あなたは何をしていますか?</p>
      <p>私は読んでいます</p>
      <br>
      <p>Что он де&#769;лает</p>
      <p>Он изуча&#769;ет</p>
      <p>彼は何をしていますか?</p>
      <p>彼は勉強しています</p>
      <br>
      <p>де́лать : する
        <br>чита́ть : 読む
        <br>изуча́ть : 勉強する
      </p>
    </div>
    <div class="text-box">
      <h2>過去形</h2>
      <br>
      <p>ロシア語の過去形は、現在形に比べると変化が圧倒的にシンプルです</p>
      <p>主語の人称に関係なく、主語の「性」と「数」だけで形が決まります</p>
      <br>
      <p>作り方としては動詞の不定形の末尾の「ть」を落として、別の語尾をつけます</p>
      <br>
      <table class="center-table">
        <thead>
          <tr>
            <th>主語の性と数</th>
            <th>語尾</th>
            <th>例：чита&#769;ть（読む）の過去形</th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td>男性（я, ты, он）</td>
            <td>-л</td>
            <td>он чита&#769;л</td>
          </tr>
          <tr>
            <td>女性（я, ты, она）</td>
            <td>-ла</td>
            <td>она чита&#769;ла</td>
          </tr>
          <tr>
            <td>中性（оно）</td>
            <td>-ло</td>
            <td>оно чита&#769;ло</td>
          </tr>
          <tr>
            <td>複数（мы, вы, они）</td>
            <td>-ли</td>
            <td >они чита&#769;ли</td>
          </tr>
        </tbody>
      </table>
      <br>
      <p>「私（я）」や「君（ты）」が使う過去形も、自分の性によって変わります</p>
      <p>自分が男性なら「-л」、女性なら「-ла」になります。</p>
      <p>現在形の複雑な変化に比べたら、天使のような優しさですね！</p>
      <br>
      <p>え？英語と比べたら複雑？</p>
      <p>高々4倍なのでそれほどですかね〜()</p>
      <br>
      <p>例</p>
      <p>Что ты де&#769;лал вчера&#769; ?</p>
      <p>Я чита&#769;л кни&#769;гу.</p>
      <p>君（男性）は昨日何をしていたの？</p>
      <p>私は本を読んでいました。</p>
      <br>
      <p>вчера&#769;: 昨日</p>
    </div>
    <div class="text-box">
      <h2>未来形</h2>
      <br>
      <p>未来形は、動詞が「不完了体」か「完了体」かによって作り方が変わるのですが、ここではまず基本となる<b>不完了体の未来形（〜しているだろう）</b>を学びます。</p>
      <p>......そんなに嫌な顔をしないでください、最初のうちは完了体なんて気にしないでいいですから</p>
      <br>
      <p>作り方は英語の「will + 動詞の原形」に似ています。</p>
      <p>英語の will に相当する<b>бытьの未来変化形</b>を主語に合わせて変化させ、後ろに<b>動詞の不定形</b>をそのままくっつけます</p>
      <br>
      <h3>○быть の未来変化</h3>
      <br>
      <table class="center-table">
        <tbody>
          <tr>
            <td>я бу́ду</td>
            <td>мы бу́дем</td>
          </tr>
          <tr>
            <td>ты бу́дешь</td>
            <td>вы бу́дете</td>
          </tr>
          <tr>
            <td>он/она/оно бу́дет</td>
            <td>они бу́дут</td>
          </tr>
        </tbody>
      </table>
      <br>
      <p>例</p>
      <p>Что вы бу́дете де́лать за́втра?</p>
      <p>Я бу́ду чита́ть.</p>
      <p>あなたは明日何をする予定ですか？</p>
      <p>私は（本を）読むつもりです。</p>
      <br>
      <p>за́втра : 明日</p>
      <br>
      <div style="white-space: pre-line;">
        {{ isExpandedV ? fullTextV : shortTextV }}
        <span class="read-more" @click="toggleTextV">
          {{ isExpandedV ? '< 折りたたむ' : '>続きを読む' }}
        </span>
      </div>
    </div>
    <div class="text-box">
      <h2>正書法</h2>
      <br>
      <p>ロシア語には、文字の組み合わせに関する絶対的な7つの文字の規則である<span style="color: red;">正書法</span>が存在します。</p>
      <p>これを無視して文字を綴ることは許されません。今後の名詞や動詞の変化で「あれなぜかここだけ変化が違う…」となる原因の9割がこれです</p>
      <br>
      <blockquote class="rule-box">
        <p><b>г, к, х, ж, ч, ш, щ</b> の後ろに <b>ы</b> を書いてはならない。</p>
        <p>代わりに <b>и</b> を書く</p>
      </blockquote>
      <br>
      <p>例えば、книга（本）を複数形にする際、女性名詞なので通常のルールでは末尾の「а」を「ы」に変えるところです</p>
      <p>しかし直前の文字が <b>г</b> なので、正書法の規則によって ы を書くことはできず、代わりに <b>и</b> になります。</p>
      <p>кни́гы → кни́ги</p>
      <br>
      <p>発音しにくいから一定の組み合わせはダメというルールです。これを覚えるだけで暗記の負担が減りますよ！</p>
    </div>
    <div class="text-box" id="declension">
      <h2>格変化</h2>
      <br>
      <p>さてやって参りました！格変化！</p>
      <p>ロシア語最大の難関であり、ロシア語で最も面白い特徴がこの<b>格変化</b>です</p>
      <p>またなんか難しそうな概念出てきた......と思わないでください、ここがロシア語の醍醐味ですから！</p>
      <br>
      <p>格変化の説明の前に一つ前提のお話をば</p>
      <p>言語は名詞の役割を示す方法に関してざっくりと3つに分けられます</p>
      <p>それぞれ<span style="color: red;">孤立語</span>、<span style="color: red;">膠着語</span>、<span style="color: red;">屈折語</span>です</p>
      <br>
      <p>抽象的に言ってもややこしいので具体例を混ぜて見ていきましょう</p>
      <p><span style="color: red;">孤立語</span>は名詞を置く位置によってその役割、つまり「何が」「何に」「何を」などを示します</p>
      <p>その代表例が中国語もです</p>
      <blockquote class="explain-sentence">
        <p>我爱你</p>
      </blockquote>
      <p>この文において、我は主語、你は目的語です。それぞれの役割を、主語は文の先頭、目的語は他動詞の後に置くことによってわかるようにしています</p>
      <p>そのため僕たちはこの文を見て、「<span style="color: red;">私は</span><span style="color: blue;">あなたを</span>愛しています」と読み取れるわけです</p>
      <br>
      <p>さて一方で<span style="color: red;">膠着語</span>は名詞に役割を示すための助詞をつけることによって役割を示します</p>
      <p>感の良い方はお気づきでしょう。日本語がその代表例です</p>
      <blockquote class="explain-sentence">
        <p>私はあなたを愛しています</p>
      </blockquote>
      <p>膠着語の特徴としては、助詞によって役割を示すため、位置をある程度自由に動かせる点にあります</p>
      <blockquote class="explain-sentence">
        <p>あなたを愛しています私は</p>
        <p>You love me</p>
      </blockquote>
      <p>日本語は位置を入れ替えても助詞のおかげで意味が通じますが、英語だと意味が逆になってしまいますね</p>
      <br>
      <p>そして<span style="color: red;">屈折語</span>というのがロシア語の分類です</p>
      <p>屈折語は名詞の末尾を変化させることによって役割を示します</p>
      <blockquote class="explain-sentence">
        <p>Я тебя люблю</p>
        <p>Я люблю тебя</p>
      </blockquote>
      <p>あなたは元々тыですが、ここでは目的語の役割を果たしているので対格のтебяとなっています</p>
      <p>格が違うので位置を入れ替えたとしても意味が通じるんですよね</p>
      <p>またロシア語は動詞も主語によって変化するので、люблюっていうことは主語は一人称単数なんだなとわかります</p>
      <div style="white-space: pre-line;">
        {{ isExpandedE ? fullTextE : shortTextE }}
        <span class="read-more" @click="toggleTextE">
          {{ isExpandedE ? '< 折りたたむ' : '>続きを読む' }}
        </span>
      </div>
      <br>
      <br>
        <p>ロシア語には6つの格があります。それぞれの基本的な役割は以下の通りです。</p>
      <br>
      <table class="center-table">
        <thead>
          <tr>
            <th>格の名称</th>
            <th>主な役割・イメージ</th>
            <th>日本語の助詞のイメージ</th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td><b>主格</b></td>
            <td>文の主語、辞書に載っている形</td>
            <td>〜は、〜が</td>
          </tr>
          <tr>
            <td><b>生格</b></td>
            <td>所有や所属、否定の対象</td>
            <td>〜の、〜がない</td>
          </tr>
          <tr>
            <td><b>与格</b></td>
            <td>相手に何かを「与える」宛先</td>
            <td>〜に（向かって）</td>
          </tr>
          <tr>
            <td><b>対格</b></td>
            <td>動作の直接の目的語</td>
            <td>〜を</td>
          </tr>
          <tr>
            <td><b>造格</b></td>
            <td>道具や手段、〜を使って</td>
            <td>〜で、〜によって</td>
          </tr>
          <tr>
            <td><b>前置格</b></td>
            <td>特定の「前置詞」と必ずセットで使う</td>
            <td>〜について、〜の中で</td>
          </tr>
        </tbody>
      </table>
      <br>
      <p>例えば、「私はイワン（Ива́н）を知っている」と言いたい時、イワンは行動の対象（対格）になるので、語尾が変化して <b>Ива́на</b> になり、「Я знаю Ива́на」となります。</p>
      <p>最初の頃は理解しにくいかもしれませんが、だんだんと面白く感じるようになりますよ</p>
    </div>
  </div>
</template>

<style scoped>
.rule-box {
  background-color: #fff5f5;
  border-left: 4px solid #cc2d2d;
  padding: 15px;
  margin: 10px 0;
  border-radius: 4px;
}
.explain-sentence {
  background-color: #EDEDFC;
  border-left: 4px solid #748EFF;
  padding: 15px;
  margin: 10px 0;
  border-radius: 4px;
}
p, td {
  font-family: "Helvetica Neue", Arial, "Liberation Sans", "DejaVu Sans", sans-serif;
}

</style>

<script>
export default {
  data() {
    return {
      fullText: `tips:英語の2人称you\n英語の2人称youもвыのように単数形と複数形が同じyouですが、実は元々youも単数形と複数形が違う形であり、長い歴史の中で単数形と複数形の区別がなくなっていったとされています。単数と複数の区別がないと不便に思うかもしれませんが、英語とロシア語という複数の言語で2人称の人称代名詞で単数と複数の区別がないということは、案外区別がなくてもどうにかなるということなのかもしれませんね`,
      shortText: `tips:英語の2人称you...`,
      isExpanded: false,

      fullTextV: `tips:「完了体」の未来形について\nロシア語の動詞には、1つの動作に対して「不完了体（プロセスの継続）」と「完了体（結果の完了）」という2つのペアが存在します。\n今回扱ったのは不完了体の未来形（буду + 不定形）ですが、将来「完了体」を覚えると、動詞を現在形と同じように単に人称変化させるだけで未来の意味（〜し終えるだろう）を表すようになります。`,
      shortTextV: `tips:「完了体」の未来形について...`,
      isExpandedV: false,

      fullTextE: `tips:実は英語も元々は「屈折語」だった？\n実は千年前の英語（古英語）は、ロシア語に負けず劣らず名詞や動詞が激しく格変化する屈折語でした。\n\nしかし、イギリスの地に様々な地域から人が移住してきたり、フランス語を話す人々（ノルマン人）に支配されたりする歴史の中で、「語尾の変化がややこしすぎるから、もう変化を無くして語順で意味を判断するようにしよう！」という動きが起こりました。その結果、格変化がほぼ全滅し、現在の語順が重要な言語に進化（退化？）したんです。\n\nただ、完全に消え去ったわけではなく、今でも「I（主格）」「my（生格）」「me（対格）」のように、人称代名詞にその屈折語の血筋が生き残っています。`,
      shortTextE: `tips:実は英語も元々は「屈折語」だった？...`,
      isExpandedE: false
    }
  },
  methods: {
    toggleText() {
      this.isExpanded = !this.isExpanded; // true/false を切り替える
    },
    toggleTextV(){
      this.isExpandedV = !this.isExpandedV; 
    },
    toggleTextE(){
      this.isExpandedE = !this.isExpandedE; 
    },
    scrollToId(id) {
      const el = document.getElementById(id)
      if (!el) return

      const rect = el.getBoundingClientRect()
      const scrollTop = window.pageYOffset || document.documentElement.scrollTop

      // 要素を画面中央に配置
      const top = rect.top + scrollTop - window.innerHeight / 4

      window.scrollTo({
        top: top,
        behavior: 'smooth'  // スムーズスクロール
      })
    }
  }
}
</script>
