<template>
  <div class="textCenterizer">
    <h1>Grammar Page</h1>
    <p>ここには文法についてまとめます。</p>
  </div>
  <div>
    <div class="text-box">
      <h2>基本的な文</h2>
      <br>
      <h3>○平叙文</h3>
      <p>э&#769;то па&#769;рк.</p>
      <p>これは公園です</p>
      <br>
      <p>э&#769;тоは「これ」、па&#769;ркは「公園」という意味
        <br>parkがпа&#769;ркなのは分かりやすくていいですね</p>
      <br>
      <p>ロシア語の特徴として英語やドイツ語、フランス語のような冠詞(a,the等)がありません</p>
      <p>英作文をしている時のように悩むことはないのが素晴らしい！！</p>
      <br>
      <p>また現在時制のSVC型の文の場合、英語のbe動詞に当たる語(бы&#769;ть)は普通使わずに省略します</p>
      <br>
      <h3>○疑問文</h3>
      <p>э&#769;то па&#769;рк?</p>
      <p>これは公園ですか？</p>
      <br>
      <p>英語のように語順を入れ替える必要はなく、語末の.を?に変えるだけで疑問文になります</p>
      <br>
      <p>○断定と疑問のイントネーション</p>
      <p>断定と疑問では文の形が変わらないので発音する際にはイントネーションで区別します</p>
      <br>
      <p>断定 : 文の最後の単語のアクセントがある音節（母音）で下降する</p>
      <p>疑問 : 疑問の中心になる単語のアクセントのある音節（母音）で上昇する</p>
      <br>
      <p>断定は英語と一緒ですね</p>
      <p>э&#769;то па&#769;рк.</p>
      <p>-- ↘_</p>
      <br>
      <p>疑問については、例えば「これは『公園』ですか？」と「公園」を強調して聞きたいときには</p>
      <p>э&#769;то па&#769;рк?</p>
      <p>-- ↗￣</p>
      <br>
      <p>「『これ』は公園ですか？」と「これ」を強調して聞きたいときには</p>
      <p>э&#769;то па&#769;рк?</p>
      <p>↗￣- -</p>
      <p>となります</p>
      <p>必要なところだけアクセントを上げ、それ以降は普通のままです</p>
      <br>
      <h3>○否定文</h3>
      <p>э&#769;то не па&#769;рк.</p>
      <p>これは公園ではありません</p>
      <br>
      <p>否定文では否定したい単語の前にне(〜ではない)をつけます</p>
      <p>否定の助詞неには普通アクセントをつけず、次の単語と繋げて発音します</p>
      <p>непа&#769;ркのように一単語として発音するイメージです</p>
      <br>
      <h3>○疑問文の答え方</h3>
      <p>э&#769;то па&#769;рк?</p>
      <br>
      <p>Да, э́то па́рк.</p>
      <p>はい、これは公園です</p>
      <p>Нет, э́то не па́рк.</p>
      <p>いいえ、これは公園ではありません</p>
      <br>
      <p>疑問文にはДа(yes)とНет(no)を使って返答しましょう</p>
      <p>返答の仕方は英語と同じです</p>
    </div>
    <div class="text-box">
      <h2>名詞の性と数</h2>
    </div>
    <div class="text-box">
      <h2>ざっくりと格変化</h2>
    </div>
    <div class="text-box">
      <h2>現在形</h2>
    </div>
    <div class="text-box">
      <h2>過去形</h2>
    </div>
    <div class="text-box">
      <h2>未来形</h2>
    </div>
    <div class="text-box">
      <h2>格変化</h2>
    </div>
  </div>
</template>

<style scoped>

</style>