<template>
  <div class="textCenterizer">
    <h1>урок по грамматике</h1>
    <p>ここには文法についてまとめます。</p>
  </div>
  <div>
    <div class="text-box">
      <h2>基本的な文</h2>
      <br>
      <h3>○平叙文</h3>
      <p>Э&#769;то па&#769;рк.</p>
      <p>これは公園です</p>
      <br>
      <p>э&#769;тоは「これ」、па&#769;ркは「公園」という意味
        <br>parkがпа&#769;ркなのは分かりやすくていいですね</p>
      <p>また文頭を大文字にするのは英語と同じです</p>
      <br>
      <p>ロシア語の特徴として、英語やドイツ語、フランス語のような冠詞(a,the等)がありません</p>
      <p>英作文をしている時のように悩むことはないのが素晴らしい！！</p>
      <br>
      <p>そして現在時制のSVC型の文の場合、英語のbe動詞に当たる語(бы&#769;ть)は普通使わずに省略します</p>
      <br>
      <h3>○疑問文</h3>
      <p>Э&#769;то па&#769;рк?</p>
      <p>これは公園ですか？</p>
      <br>
      <p>英語のように語順を入れ替える必要はなく、語末の.を?に変えるだけで疑問文になります</p>
      <br>
      <p>○断定と疑問のイントネーション</p>
      <p>断定と疑問では文の形が変わらないので発音する際にはイントネーションで区別します</p>
      <br>
      <p>断定 : 文の最後の単語のアクセントがある音節（母音）で下降する</p>
      <p>疑問 : 疑問の中心になる単語のアクセントのある音節（母音）で上昇する</p>
      <br>
      <p>断定は英語と一緒ですね</p>
      <p>Э&#769;то па&#769;рк.</p>
      <p>-- ↘_</p>
      <br>
      <p>疑問については、例えば「これは『公園』ですか？」と「公園」を強調して聞きたいときには</p>
      <p>Э&#769;то па&#769;рк?</p>
      <p>-- ↗￣</p>
      <br>
      <p>「『これ』は公園ですか？」と「これ」を強調して聞きたいときには</p>
      <p>э&#769;то па&#769;рк?</p>
      <p>↗￣- -</p>
      <p>となります</p>
      <p>必要なところだけアクセントを上げ、それ以降は普通のままで、上げません</p>
      <br>
      <h3>○否定文</h3>
      <p>Э&#769;то не па&#769;рк.</p>
      <p>これは公園ではありません</p>
      <br>
      <p>否定文では否定したい単語の前にне(〜ではない)をつけます</p>
      <p>否定の助詞неには普通アクセントをつけず、次の単語と繋げて発音します</p>
      <p>непа&#769;ркのように一単語として発音するイメージです</p>
      <br>
      <h3>○疑問文の答え方</h3>
      <p>Э&#769;то па&#769;рк?</p>
      <br>
      <p>Да, Э&#769;то па&#769;рк.</p>
      <p>はい、これは公園です</p>
      <p>Нет, Э&#769;то не па&#769;рк.</p>
      <p>いいえ、これは公園ではありません</p>
      <br>
      <p>疑問文にはДа(yes)とНет(no)を使って返答しましょう</p>
      <p>返答の仕方は英語と同じです</p>
      <br>
      <h3>○疑問詞を使った疑問文</h3>
      <p>Ктo э&#769;то? — Э&#769;то Иван.</p>
      <p>これはだれですか？ — これはイワンです</p>
      <br>
      <p>Что э&#769;то? — Э&#769;то кни́га.</p>
      <p>これは何ですか？ — これは本です</p>
      <p>※чтоは例外で[што]と発音する</p>
      <br>
      <p><b>Где Анна?</b> — Она до&#769;ма.</p>
      <p>彼はどこですか？ — 彼は家にいます</p>
      <br>
      <p>чтоはものについて尋ねるとき、ктoは人や動物について尋ねるときに使います</p>
      <p>гдеは人や物が存在する（いる/ある）場所を尋ねるときに使います</p>
      <br>
      <p>疑問詞のある疑問文では疑問詞でイントネーションを上げ、それ以降はそのままです</p>
      <p>「『これ』は公園ですか？」の文のように発音します</p>
      <br>
      <p>онаは「彼女」を意味する代名詞で、英語で言えばsheです</p>
      <p>彼の場合はонになります</p>
      <p>
        詳しくは
        <a href="#p_pronoun" @click.prevent="scrollToId('p_pronoun')">人称代名詞</a>
        を参照
      </p>        
      <br>
      <p>до&#769;маは「家で、家に」という意味の副詞です</p>
      <p>гдеの文で使える副詞としては他に、там(あそこに、あそこで)、здесь(ここで、ここに)などがあります</p>
      <br>
      <p>他の疑問詞としては、Куда&#769;(どこへ),Когда&#769;(いつ),Почему&#769;(なぜ),Как(どのように/どうやって)などがありますが、ここではその紹介だけに留めます
        <br>なぜならこれらを使う文を考えるときには動詞を使いたくなり、動詞を使った文を扱うためにはその前に性と数、格変化について扱わなければならないからです</p>
    </div>
    <div class="text-box">
      <h2>名詞の性と数</h2>
      <p>ロシア語の名詞には文法上の性(男性・女性・中性)があります</p>
      <p>それぞれの単語の性は、（多少の例外はあるにしろ）概ね末尾の文字によって決まります</p>
      <br>
      <p>いやぁ、末尾の文字で性が分かるなんて簡単なシステムでよかった、フランス語やドイツ語では各単語ごとに不規則に決まっていて全部暗記しないといけないですから</p>
      <br>
      <table class="center-table">
        <tr>
          <th></th>
          <th colspan="3">末尾の文字</th>
        </tr>
        <tr>
          <td>男性名詞</td>
          <td>(й以外の子音文字)<br>журна&#769;л 雑誌</td>
          <td>й<br>музе&#769;й 博物館</td>
          <td>ь<br>слова&#769;рь 辞書</td>
        </tr>
        <tr>
          <td>女性名詞</td>
          <td>а<br>по&#769;чта 郵便局</td>
          <td>я<br>ле&#769;кция 講義</td>
          <td>ь<br>тетра&#769;дь ノート</td>
        </tr>
        <tr>
          <td>中性名詞</td>
          <td>о<br>письмо&#769; 手紙</td>
          <td>е<br>мо&#769;ре 海</td>
          <td>мя<br>вре&#769;мя 時間</td>
        </tr>
      </table>
      <br>
      <p>それでもьで終わる単語は男性名詞にも女性名詞にもあるので、ьで終わる単語に関しては暗記が必要ですが......これでもだいぶ楽な方だと思って割り切りましょう！</p>
      <br>
      <p>また、例外として、аやяで終わっていたとしても男性を表す単語なら男性名詞となります</p>
      <br>
      <p>例 : па&#769;па(父親), дя&#769;дя(叔父), ми&#769;ша(михаилの愛称)</p>
      <br>
      <p>ми&#769;шаっていうと日本人の感覚としては響きが女性っぽいですが、男性の名前なんですよね......ロシア語の愛称は不可思議</p>
      <br>
      <p>名詞を複数形にするときには、英語のように単純にsをつけるのではなく、名刺の性や末尾の文字によって末尾の形を変化させます</p>
      <br>
      <table class="center-table">
        <tr>
          <th></th>
        <th colspan="3">末尾の文字（単数形）</th>
        </tr>
        <tr>
          <td>男性名詞</td>
          <td>(й以外の子音文字)<br>журна́л → журна́лы</td>
          <td>й<br>музе́й → музе́и</td>
          <td>ь<br>слова́рь → слова́ри</td>
        </tr>
        <tr>
          <td>女性名詞</td>
          <td>а<br>по́чта → по́чты</td>
          <td>я<br>ле́кция → ле́кции</td>
          <td>ь<br>тетра́дь → тетра́ди</td>
        </tr>
        <tr>
          <td>中性名詞</td>
          <td>о<br>пи́сьмо → пи́сьма</td>
          <td>е<br>мо́ре → мо́ря</td>
          <td>мя<br>вре́мя → вре́мена</td>
        </tr>
      </table>
      <br>
      <p>мя → менаだけ特殊ですが、他はй以外の子音の時を除いて、文字1つの文字が1つの文字に変わっているだけなので、頑張って覚えましょう！</p>
    </div>
    <div class="text-box">
      <h2>所有代名詞</h2>
      <p>所有代名詞は名詞の性と数に合わせて変化します</p>
      <br>
      <table class="center-table">
        <tr>
          <th></th>
          <th>男性形</th>
          <th>女性形</th>
          <th>中性形</th>
          <th>複数形</th>
        </tr>
        <tr>
          <td>私の</td>
          <td>мой</td>
          <td>моя&#769;</td>
          <td>моё</td>
          <td>мои&#769;</td>
        </tr>
        <tr>
          <td>君の</td>
          <td>твой</td>
          <td>твоя&#769;</td>
          <td>твоё</td>
          <td>твои&#769;</td>
        </tr>
        <tr>
          <td>あなたの</td>
          <td>ваш</td>
          <td>ва&#769;ша</td>
          <td>ва&#769;ше</td>
          <td>ва&#769;ши</td>
        </tr>
      </table>
      <br>
      <p>「君の」と「あなたの」で意味が被ってると思うかもしれませんが、тыに対応するのがтвой、выに対応するのがвашです</p>
      <p>тыとвыの使い分けについては次項で</p>
      <p>твойはмойと同じ変化をするので覚えやすいですね</p>
      <br>
      <p>例</p>
      <p>мой па&#769;па 私の父</p>
      <p>твоя&#769; ма&#769;ма 君の母</p>
      <p>ва&#769;ше письмо&#769; あなたの手紙</p>
      <p>ва&#769;ши кни&#769;ги あなたの本(кни&#769;гиはкни&#769;гаの複数形)</p>
    </div>
    <div class="text-box" id="p_pronoun">
      <h2>人称代名詞</h2>
      <p>人称代名詞の主格です(格については<a href="declension" @click.prevent="scrollToId('declension')">後述</a> )</p>
      <br>      
      <table class="center-table">
        <thead>
          <tr>
            <th></th>
            <th colspan="2">単数</th>
            <th colspan="2">複数</th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td>1人称</td>
            <td>私</td>
            <td>я</td>
            <td>私たち</td>
            <td>мы</td>
          </tr>
          <tr>
            <td rowspan="2">2人称</td>
            <td>君</td>
            <td>ты</td>
            <td rowspan="2">君たち、あなたたち</td>
            <td rowspan="2">вы</td>
          </tr>
          <tr>
            <td>あなた</td>
            <td>вы</td>
          </tr>
          <tr>
            <td rowspan="3">3人称</td>
            <td>彼</td>
            <td>он</td>
            <td rowspan="3">彼ら、彼女ら、それら</td>
            <td rowspan="3">они&#769;</td>
          </tr>
          <tr>
            <td>彼女</td>
            <td>она&#769;</td>
          </tr>
          <tr>
            <td>それ</td>
            <td>оно&#769;</td>
          </tr>
        </tbody>
      </table>
      <br>
      <p>注意点として、2人称単数を表す場合にも、遠慮がいる相手にはтыではなくвыを使います</p>
      <p>日本語で言えば、「君、お前」くらいのニュアンスの言葉がты、「あなた」がвыです</p>
      <br>
      <p>тыを使う相手は、家族、友人などの親しい相手、子供などに限られます</p>
      <p>丁寧に話すときや目上の人に話すときにはвыを使います</p>
      <br>
      <p>тыの複数形はвыですが、выは単数も複数もвыです</p>
      <br>
      <div style="white-space: pre-line;">
        {{ isExpanded ? fullText : shortText }}
        <span class="read-more" @click="toggleText">
          {{ isExpanded ? '< 折りたたむ' : '>続きを読む' }}
        </span>
      </div>
      <br>
      <p>例</p>
      <p>Кто вы?</p>
      <p>Я студент</p>
      <p>あなたは誰ですか？</p>
      <p>私は学生です</p>
      <br>
      <p>Кто вы?</p>
      <p>мы студенты(студентыはстудентの複数形)</p>
      <p>あなたたちは誰ですか？</p>
      <p>私たちは学生です</p>
      <br> 
    </div>
    <div class="text-box">
      <h2>動詞の変化</h2>
      <br>
      <h3>○現在形・第1変化</h3>
      <p>動詞の現在形は主語の人称と数によって語尾が変化します。
        <br>変化する前の形のことを（不定形）と呼び、多くの動詞は不定形がтьで終わります
      </p>
      <br>
      <p>動詞の変化には主に第1変化と第2変化があり、どちらの変化をするかは単語ごとに異なります</p>
      <p>しかし語尾を見ればある程度どちらか分かります</p>
      <p>ちなみに英語のような現在形と現在進行形の区別はありません</p>
      <br>
      <table class="center-table">
        <thead>
          <tr>
            <th>不定形</th>
            <th>знать</th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td>1人称単数</td>
            <td>я зна́ю</td>
          </tr>
          <tr>
            <td>2人称単数</td>
            <td>ты зна́ешь</td>
          </tr>
          <tr>
            <td>3人称単数</td>
            <td>он/она/оно зна́ет</td>
          </tr>
          <tr>
            <td>1人称複数</td>
            <td>мы зна́ем</td>
          </tr>
          <tr>
            <td>2人称複数</td>
            <td>вы зна́ете</td>
          </tr>
          <tr>
            <td>3人称複数</td>
            <td>они зна́ют</td>
          </tr>
        </tbody>
      </table>
      <br>
      <p>はい、このあたりから暗記が辛くなってきますね</p>
      <p>ロシア語学習で一番辛いのがこのような多彩な格変化です</p>
      <p>逆に言えば格変化をマスターすれば後はどうにでもなります</p>
      <p>.....なーんて綺麗事言っても辛いものは辛いので、ただ頑張るしかないですね</p>
      <br>
      <p>例</p>
      <p>Что вы де&#769;лаете?</p>
      <p>Я чита&#769;ю</p>
      <p>あなたは何をしていますか?</p>
      <p>私は読んでいます</p>
      <br>
      <p>Что он де&#769;лает</p>
      <p>Он изуча&#769;ет</p>
      <p>彼は何をしていますか?</p>
      <p>彼は勉強しています</p>
      <br>
      <p>де́лать : する
        <br>чита́ть : 読む
        <br>изуча́ть : 勉強する
      </p>
    </div>
    <div class="text-box">
      <h2>過去形</h2>
      <p>以下工事中</p>
    </div>
    <div class="text-box">
      <h2>未来形</h2>
    </div>
    <div class="text-box" id="declension">
      <h2>格変化</h2>
    </div>
  </div>
</template>

<style scoped>

</style>

<script>
export default {
  data() {
    return {
      fullText: `tips:英語の2人称you\n英語の2人称youもвыのように単数形と複数形が同じyouですが、実は元々youも単数形と複数形が違う形であり、長い歴史の中で単数形と複数形の区別がなくなっていったとされています。単数と複数の区別がないと不便に思うかもしれませんが、英語とロシア語という複数の言語で2人称の人称代名詞で単数と複数の区別がないということは、案外区別がなくてもどうにかなるということなのかもしれませんね`,
      shortText: `tips:英語の2人称you...`,
      isExpanded: false
    }
  },
  methods: {
    toggleText() {
      this.isExpanded = !this.isExpanded; // true/false を切り替える
    },
    toggleTextV(){
      this.isExpandedV = !this.isExpandedV; 
    },
    scrollToId(id) {
      const el = document.getElementById(id)
      if (!el) return

      const rect = el.getBoundingClientRect()
      const scrollTop = window.pageYOffset || document.documentElement.scrollTop

      // 要素を画面中央に配置
      const top = rect.top + scrollTop - window.innerHeight / 4

      window.scrollTo({
        top: top,
        behavior: 'smooth'  // スムーズスクロール
      })
    }
  }
}
</script>
